#
# description:
# author:wuhongliang
# date:2015-11-05 14:00:18
# modify:
#
    testcase{
      attr = {"id"=>"ZLBF_15.1.1", "level"=>"P3", "auto"=>"n"}
    def prepare

    end

    def process

      operate("1、DUT的接入类型选择为DHCP，保存配置，PC1设置为自动获取IP地址，如：192.168.100.x，进入到管理界面中的IP过虑界面；") {

}

operate("2、在“源IP地址”输入全0，全1，或0开头地址或0结尾地址，如：0.0.0.0，255.255.255.255，0.0.0.1，192.0.0.0是否允许输入；") {

}

operate("3、在“源IP地址”输入D类地址或E类地址、组播地址，如：224.1.1.1，240.1.1.1，255.1.1.1，是否允许输入；") {

}

operate("4、在“源IP地址”输入大于255或小于0或小数的数字，如：256，-11，是否允许输入；") {

}

operate("5、在“源IP地址”输入广播地址，如：192.168.2.255,10.255.255.255，是否允许输入；") {

}

operate("6、在“源IP地址”输入与LAN口IP同一个地址，如：192.168.100.1，是否允许输入；") {

}

operate("7、在“源IP地址”输入与DUTWAN口的IP地址，是否允许输入；") {

}

operate("8、在“源IP地址”输入回环地址，如：127.0.0.1，是否允许输入；") {

}

operate("9、在“源IP地址”输入A~Z,a~z,~!@#$%^等33个特殊字符，中文，空格，为空等，是否允许输入；") {

}

operate("10、再在“目的IP地址”输入步骤2-9中所有的值，查看是否允许输入。") {

}



    end

    def clearup

    end

    }
