#
# description:
# author:wuhongliang
# date:2015-11-05 14:00:19
# modify:
#
    testcase{
      attr = {"id"=>"ZLBF_15.1.21", "level"=>"P3", "auto"=>"n"}
    def prepare

    end

    def process

      operate("1、进入IP过滤配置页面；") {

}

operate("2、添加一条协议选择TCP，起始与结束端口设置1111，过滤IP设置为192.168.100.100，是否可以保存；") {

}

operate("3、添加一条协议选择TCP，起始与结束端口设置1111，过滤IP设置为192.168.100.100，是否可以保存；") {

}

operate("4、添加一条协议选择UDP，起始与结束端口设置2222，过滤IP设置为192.168.100.100，是否可以保存；") {

}

operate("5、添加一条协议选择UDP，起始与结束端口设置2222，过滤IP设置为192.168.100.100，是否可以保存；") {

}

operate("6、添加一条协议选择TCP/UDP，起始与结束端口设置3333~3344，过滤IP设置为192.168.100.100~105，是否可以保存；") {

}

operate("7、添加一条协议选择TCP/UDP，起始与结束端口设置3333~3344，过滤IP设置为192.168.100.100~105，是否可以保存；") {

}

operate("8、添加一条协议选择TCP，起始与结束端口设置3333，过滤IP设置为192.168.100.100，是否可以保存；") {

}

operate("9、添加一条协议选择UDP，起始与结束端口设置3333，过滤IP设置为192.168.100.100，是否可以保存；") {

}

operate("10、编辑步骤9中添加的规则，修改协议为TCP，是否可以保存。") {

}

operate("建议：对IP地址重叠，端口重叠可以不作检测。") {

}



    end

    def clearup

    end

    }
