#
# description:
# author:wuhongliang
# date:2015-11-05 14:00:19
# modify:
#
    testcase{
      attr = {"id"=>"ZLBF_17.1.2", "level"=>"P4", "auto"=>"n"}
    def prepare

    end

    def process

      operate("1、在“IP地址”输入全0，全1，或0开头地址或0结尾地址，如：0.0.0.0，255.255.255.255，0.0.0.1，192.0.0.0是否允许输入；") {

}

operate("2、在“IP地址”输入D类地址或E类地址、组播地址，如：224.1.1.1，240.1.1.1，255.1.1.1，是否允许输入；") {

}

operate("3、在“IP地址”输入大于255或小于0或小数的数字，如：256，-11，是否允许输入；") {

}

operate("4、在“IP地址”输入广播地址，如：192.168.2.255,10.255.255.255，是否允许输入；") {

}

operate("5、输入与LAN口IP同一个地址，如：192.168.100.1，是否允许输入；") {

}

operate("6、输入与DUT WAN口的IP地址地址，是否允许输入；") {

}

operate("7、输入回环地址，如：127.0.0.1，是否允许输入；") {

}

operate("8、在IP地址输入A~Z,a~z,~!@#$%^等33个特殊字符，中文，空格，为空等，是否允许输入；") {

}



    end

    def clearup

    end

    }
